Repository: kirrishima/FluentDownloader
Catalog: src/FluentDownloader/Strings/*/Settings.resw
Source language: en_us
Languages: ru_ru

# HomePageHeader
source: Home
ru_ru: Главная

# SettingsButtonTextBlock.Text
source: Settings
ru_ru: Настройки

# YtdlpAndFfmpegSettingsHeader.Text
source: yt-dlp & FFmpeg Settings
ru_ru: Настройки yt-dlp & FFmpeg

# InstallationSettings.Text
source: Output File Template
ru_ru: Шаблон выходного файла

# LanguageSettingsSectionHeader.Text
source: Language
ru_ru: Язык

# LanguageSettingsSelectLanguage.Text
source: Language Settings
ru_ru: Настройки языка

# AppearanceSectionHeader.Text
source: Appearance
ru_ru: Оформление

# AppearanceSectionThemeHeader.Text
source: Theme
ru_ru: Тема

# AppearanceSectionThemeDescription.Text
source: The app's theme. You can choose between light and dark modes. Some changes may require restarting the app.
ru_ru: Тема приложения. Может быть светлой или тёмной. Для некоторых страниц может потребоваться перезапуск приложения.

# AppearanceSectionAccentColorHeader.Text
source: Accent Color
ru_ru: Акцентный цвет

# AccentColorSystemHeader.Text
source: Use system color
ru_ru: Использовать цвет системы

# AccentColorSystemDescription.Text
source: Uses the system color, automatically changing based on the selected color in Windows settings
ru_ru: Использует цвет системы, автоматически изменяя значение в зависимости от выбранного цвета в найтройках Windows

# AccentColorPickHeader.Text
source: Customize theme color
ru_ru: Настроить цвет темы

# AccentColorPickDescription.Text
source: You can choose a theme color, and all controls will use this color as the primary one
ru_ru: Вы можете выбрать цвет темы, и все элементы управления будут использовать этот цвет в качестве основного

# SelectAccentColorButtonTextBlock.Text
source: Select color
ru_ru: Выбрать цвет

# AppearanceSectionAccentColorDescription.Text
source: The main color used in the app's design. By default, it matches the system's accent color.
ru_ru: Основной цвет, используемый в приложении. По умолчанию синхронизируется с основным системным цветом.

# AppearanceSectionWindowBGColorHeader.Text
source: Window Background Color
ru_ru: Фоновый цвет окна

# AppearanceSectionWindowBGDescription.Text
source: Sets the background color of the window with an acrylic effect. It overlays the default screen and adds a tinted acrylic look.
ru_ru: Задаёт фоновый цвет окна с акриловым эффектом. Накладывается на основной экран и добавляет цветной акриловый слой.

# AppearanceSectionResetHeader.Text
source: Reset Background Style
ru_ru: Сбросить стиль фона

# AppearanceSectionResetDescription.Text
source: Restore all background settings to their default values.
ru_ru: Восстановить все настройки фона по умолчанию.

# AppearanceSectionWindowBGSelectColorButton.Text
source: Choose Color
ru_ru: Выбрать цвет

# AppearanceBackgroundSectionHeader.Text
source: Background
ru_ru: Задний фон

# AppearanceThemeSectionHeader.Text
source: Theme
ru_ru: Тема

# AppearanceMicaHeader.Text
source: Mica
ru_ru: Слюда (Mica)

# AppearanceMicaDescription.Text
source: Mica is an opaque, dynamic material that incorporates theme and desktop wallpaper to paint the background.
ru_ru: Слюда — это непрозрачный динамический материал, который включает в себя тему и обои рабочего стола для создания фона.

# AppearanceAcrylicHeader.Text
source: Acrylic
ru_ru: Акрил

# AppearanceAcrylicDescription.Text
source: Acrylic is a type of Brush that creates a translucent texture. Background acrylic reveals the desktop wallpaper and other windows that are behind the currently active app, adding depth between application windows while celebrating the user's personalization preferences.
ru_ru: Акрил — это разновидность кисти, которая создает полупрозрачную текстуру. Акриловый фон обнажает обои рабочего стола и другие окна, находящиеся за активным в данный момент приложением, добавляя глубину между окнами приложения и подчеркивая предпочтения персонализации пользователя.

# AppearanceSolidHeader.Text
source: Solid color
ru_ru: Сплошной цвет

# AppearanceSolidDescription.Text
source: The background consists of one solid color, without any transparency effect.
ru_ru: Фон состоит из одного цвета, без эффектов прозрачности.

# SaveButtonTeachingTipEmpty
source: The template must not be empty.
ru_ru: Шаблон не должен быть пустым.

# SaveButtonTeachingTipWrong
source: The template must end with '.%(ext)s'
ru_ru: Шаблон должен заканчиваться на '.%(ext)s'

# OutputTemplateFormatsExamle.Text
source: <![CDATA[Some available formats: %(title)s - Video title %(id)s - Video ID %(uploader)s - Channel name %(upload_date)s - Upload date (YYYYMMDD) %(ext)s - File extension %(playlist)s - Playlist name %(playlist_index)s - Playlist index There are many available formats, and not all can be shown here. For more details, please visit the link below:]]>
ru_ru: <![CDATA[Некоторые доступные форматы: %(title)s - Название видео %(id)s - ID видео %(uploader)s - Имя канала %(upload_date)s - Дата загрузки (YYYYMMDD) %(ext)s - Расширение файла %(playlist)s - Название плейлиста %(playlist_index)s - Номер в плейлисте Число доступных форматов очень большое и они не могут быть все представленны тут. Подробнее можно узнать по ссылке:]]>

# OutputTemplateExploreMore.Text
source: Learn more
ru_ru: Узнать больше

# OutputTemplateHeaderTextBox.Header
source: Output File Template
ru_ru: Шаблон выходных файлов

# DownloadDependenciesSectionHeader.Text
source: Dependencies
ru_ru: Зависимости

# YtdlpAndFFmpegSettingsCardBreadcrump
source: yt-dlp and ffmpeg
ru_ru: yt-dlp и ffmpeg

# CheckYtdlpAndFfmpegUpdatesHeader.Text
source: Check for component updates
ru_ru: Проверить обновления компонентов

# CheckYtdlpUpdatesHeader.Text
source: Check for yt-dlp updates
ru_ru: Проверить обновления yt-dlp

# CheckFfmpegUpdatesHeader.Text
source: Check for ffmpeg updates
ru_ru: Проверить обновления ffmpeg

# ShowVideoThumbnailAndTitleHeader.Text
source: Show video thumbnail and title after format parsing
ru_ru: Показывать миниатюру видео и его название после парсинга форматов

# PickYtdlpExeHeader.Text
source: Select yt-dlp executable
ru_ru: Выбрать исполняемый файл yt-dlp

# PickYtdlpExeChooseHeader.Text
source: Manually select yt-dlp executable
ru_ru: Выбрать исполняемый файл yt-dlp вручную

# PickExeChooseDescription.Text
source: Note that the application determines whether an executable is the required dependency by launching it with specific parameters. If the executable exists and returns a success code, it will be recognized as the required dependency, even if that is not actually the case.
ru_ru: Обратите внимание, что приложение использует запуск приложения с определенными параметрами для определения, является ли оно нужной зависимостью. Если приложение существует и возвращает код успеха, то оно будет распознанно как нужна зависимость, даже если это не так.

# PickYtdlpExeLetAppDecideHeader.Text
source: Let the application determine the path automatically
ru_ru: Позволить приложению автоматически определить путь

# PickYtdlpExeLetAppDecideDecription.Text
source: yt-dlp must be in the PATH or in the application's local directory. Otherwise, the application won't be able to find the executable and will prompt you to download it.
ru_ru: yt-dlp должен быть в PATH или в локальной дирректории приложения. Иначе приложение не сможет найти исполняемый файл и предложит его загрузить

# PickFfmpegExeHeader.Text
source: Select ffmpeg executable
ru_ru: Выбрать исполняемый файл ffmpeg

# PickFfmpegExeChooseHeader.Text
source: Manually select ffmpeg executable
ru_ru: Выбрать исполняемый файл ffmpeg вручную

# PickFfmpegExeLetAppDecideHeader.Text
source: Let the application determine the path automatically
ru_ru: Позволить приложению автоматически определить путь

# PickFfmpegExeLetAppDecideDecription.Text
source: ffmpeg must be in the PATH or in the application's local directory. Otherwise, the application won't be able to find the executable and will prompt you to download it.
ru_ru: ffmpeg должен быть в PATH или в локальной дирректории приложения. Иначе приложение не сможет найти исполняемый файл и предложит его загрузить

# LaunchSettingsHeader.Text
source: Launch Settings
ru_ru: Настройки запуска

# LaunchSettingsDescription.Text
source: You can configure certain aspects of the application's launch.
ru_ru: Вы можете настроить некоторые аспекты запуска приложения

# LaunchSettingsSectionHeader
source: Launch
ru_ru: Запуск

# FullScreenModeHeader.Text
source: Full-Screen Mode
ru_ru: Полноэкранный режим

# FullScreenModeDescription.Text
source: Launch the application in full-screen mode.
ru_ru: Запускать приложение в полноэкранном режиме

# ScreenSizeHeader.Text
source: Window Size
ru_ru: Размер окна

# ScreenSizeDescription.Text
source: The size of the application window in which the app will launch. To allow the app to decide automatically, set at least one of the dimensions to 0.
ru_ru: Размер окна приложения, в котором будет запускаться приложение. Чтобы позволить приложению решать самостоятельно, установите хотя бы одно из измерений в 0.

# DownloadingSectionHeader.Text
source: Download settings
ru_ru: Настройки загрузок

# LogFinalOptionsSectionHeader.Text
source: Log final yt-dlp arguments
ru_ru: Выводить финальные аргументы yt-dlp

# LogFinalOptionsSectionDescription.Text
source: If enabled, installation logs will include the command-line arguments used to launch yt-dlp.
ru_ru: Если включено, будет выводить в логи установки параметры коммандной строки, которые были использованы для запуска yt-dlp

# YtdlpConcurrentFragmentsHeader.Text
source: Concurrent Fragments
ru_ru: Одновременные фрагменты

# YtdlpConcurrentFragmentsDescription.Text
source: [--concurrent-fragments] Sets the number of video fragments to download simultaneously. Increasing this value may speed up the download, but an excessively high number can lead to server blocking, network overload, system errors, or even slow down the download. Recommended value: 6
ru_ru: [--concurrent-fragments] Задает количество фрагментов видео, загружаемых одновременно. Увеличение значения может ускорить загрузку, но чрезмерно большое число может привести к блокировке сервером, перегрузке сети или ошибкам в системе, и даже замедлению загрузки. Рекомендуемое значение: 6

# DownloadRateLimitHeader.Text
source: Limit Download Speed
ru_ru: Ограничить скорость скачивания

# DownloadRateLimitDescription.Text
source: Allows you to limit the maximum download speed, which may reduce network load for higher priority tasks.
ru_ru: Позволяет ограничить максимальную скорость скачивания, что может снизить нагрузку на сеть для выполнения более приоритетных задач

# DownloadRateLimitNumberBox.Header
source: Limit Value
ru_ru: Значение ограничения

# DownloadRateLimitComboBox.Header
source: Measurement Units
ru_ru: Единицы измерения

# ProxyHeader.Text
source: Use Proxy
ru_ru: Использовать прокси

# ProxyDescription.Text
source: You can enter the proxy server address that will be used during downloads.
ru_ru: Вы можете ввести адрес прокси сервера, которые будет использован при скачивании

# ProxyTextBoxHeader.Header
source: Enter proxy:
ru_ru: Введите прокси:

# ProxyExplanationText.Text
source: <![CDATA[ Enter the proxy server address in one of the following formats: 1. Proxy without authentication: http://proxy.example.com:3128 2. Proxy with authentication: http://username:password@proxy.example.com:3128 3. For SOCKS proxies (socks4 or socks5): socks5://username:password@proxy.example.com:1080 Example: http://user:pass@192.168.0.1:8080 ]]>
ru_ru: <![CDATA[Введите адрес прокси-сервера в одном из следующих форматов: 1. Прокси без авторизации: http://proxy.example.com:3128 2. Прокси с авторизацией: http://username:password@proxy.example.com:3128 3. Для SOCKS-прокси (socks4 или socks5): socks5://username:password@proxy.example.com:1080 Пример: http://user:pass@192.168.0.1:8080]]>

# ProxyFormatGuidHeader.Header
source: Proxy server formats (click for details)
ru_ru: Форматы прокси-сервера (нажмите для деталей)

# DesktopNotificationsPage
source: Desktop Notifications
ru_ru: Уведомления

# DesktopNotificationsAreNotSupported.Title
source: Not Supported
ru_ru: Не поддерживается

# DesktopNotificationsAreNotSupported.Message
source: Desktop notifications are not supported on your device.
ru_ru: Уведомления рабочего стола не поддерживаются на вашем устройстве

# DesktopNotificationsPageLink.Text
source: Desktop Notifications
ru_ru: Уведомления на рабочем столе

# EnableDesktopNotificationsHeader.Text
source: Enable Desktop Notifications
ru_ru: Включить уведомления на рабочем столе

# EnableDesktopNotificationsDescription.Text
source: By default, desktop notifications are displayed only when the application is inactive (minimized) and only inform about video download results.
ru_ru: Уведомления на рабочем столе по умолчанию отображаются только когда приложение неактивно (свернуто) в данный момент и только информируют о результатах скачивания видео

# EnableDesktopNotificationsSoundHeader.Text
source: Enable Sound
ru_ru: Включить звук

# EnableDesktopNotificationsSoundDescription.Text
source: Plays the default sound when a notification appears. If disabled, notifications will appear silently.
ru_ru: Воспроизводит стандартный звук при появлении уведомления. Если выключено, уведомления будут появляться без звука.

# DesktopNotificationsShowOnlyIfInnactiveHeader.Text
source: Display Only When App Is Inactive
ru_ru: Отображать только если приложение неактивно

# DesktopNotificationsShowOnlyIfInnactiveDescription.Text
source: If enabled, desktop notifications will appear only when the application is inactive or minimized.
ru_ru: Если включено, уведомления на рабочем столе будут появляться только если приложение неактивно или свернуто.

# DesktopNotificationsActionHeader.Text
source: Show Application Window on Notification Click
ru_ru: Показывать окно приложения при нажатии на уведомление

# DesktopNotificationsActionDescription.Text
source: If enabled, when you click the notification and the application is inactive or minimized, it will be brought to the foreground. Otherwise, the notification will simply close.
ru_ru: Если включено, при нажатии на уведомление, если приложение неактивно или было свернуто, оно будет перенесено на передний план. Иначе уведомление будет просто закрываться.

# DesktopNotificationsShowThumbnailHeader.Text
source: Enable Video Thumbnail in Notification
ru_ru: Включить миниатюру видео в уведомление

# DesktopNotificationsThumbnailSizeHeader.Text
source: Notification Image Size
ru_ru: Размер изображения в уведомлении

# DesktopNotificationsThumbnailSizeDescription.Text
source: <![CDATA[Inline - large image at the bottom of the notification Hero - large image at the top of the notification appLogoOverride - small square image on the left side of the notification]]>
ru_ru: <![CDATA[Inline - большое изображение внизу уведомления Hero - большое изображение в верхней части уведомления appLogoOverride - маленькое квадратное изображение в левой части уведомления]]>
